
	created resnet_v1_50/resnet_v1_50.onnx
run_caffe2()
prepared_backend.predict_net: name: "tf2onnx_predict"
op {
  input: "input:0"
  output: "resnet_v1_50/Pad:0"
  name: "resnet_v1_50/Pad"
  type: "PadImage"
  arg {
    name: "pads"
    ints: 3
    ints: 3
    ints: 3
    ints: 3
  }
}
op {
  input: "resnet_v1_50/Pad:0"
  output: "resnet_v1_50/conv1/Conv2D__2:0"
  name: "resnet_v1_50/conv1/Conv2D__2"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/conv1/Conv2D__2:0"
  input: "resnet_v1_50/conv1/weights:0"
  output: "resnet_v1_50/conv1/Conv2D:0"
  name: "resnet_v1_50/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "kernels"
    ints: 7
    ints: 7
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
}
op {
  input: "resnet_v1_50/conv1/Conv2D:0"
  input: "resnet_v1_50/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm__5:0"
  name: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm__5"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/conv1/BatchNorm/FusedBatchNorm__5:0"
  output: "resnet_v1_50/conv1/Relu:0"
  name: "resnet_v1_50/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/conv1/Relu:0"
  output: "resnet_v1_50/pool1/MaxPool__6:0"
  name: "resnet_v1_50/pool1/MaxPool__6"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/pool1/MaxPool__6:0"
  output: "resnet_v1_50/pool1/MaxPool:0"
  name: "resnet_v1_50/pool1/MaxPool"
  type: "MaxPool"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
}
op {
  input: "resnet_v1_50/pool1/MaxPool:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__15:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__15"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__15:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D__16:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D__16"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D__16:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__19:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__19"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__19:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D__20:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D__20"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D__20:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__23:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__23"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/pool1/MaxPool:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm__11:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm__11"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm__11:0"
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__23:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/add:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/add"
  type: "Add"
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/add:0"
  output: "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu:0"
  name: "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D__24:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D__24"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D__24:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__27:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__27"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__27:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D__28:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D__28"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D__28:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__31:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__31"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__31:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D__32:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D__32"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D__32:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__35:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__35"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu:0"
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__35:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/add:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/add"
  type: "Add"
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/add:0"
  output: "resnet_v1_50/block1/unit_2/bottleneck_v1/Relu:0"
  name: "resnet_v1_50/block1/unit_2/bottleneck_v1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D__38:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D__38"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D__38:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/weights:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__41:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__41"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__41:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Relu:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Relu:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/Pad:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/Pad"
  type: "PadImage"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/Pad:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D__42:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D__42"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D__42:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/weights:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D"
  type: "Conv"
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__45:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__45"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__45:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Relu:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Relu:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D__46:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D__46"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D__46:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/weights:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/gamma:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/beta:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__49:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__49"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_2/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool__36:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool__36"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool__36:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool"
  type: "MaxPool"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool__37:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool__37"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool__37:0"
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__49:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/add:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/add"
  type: "Add"
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/add:0"
  output: "resnet_v1_50/block1/unit_3/bottleneck_v1/Relu:0"
  name: "resnet_v1_50/block1/unit_3/bottleneck_v1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D__54:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D__54"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D__54:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/weights:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__57:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__57"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__57:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Relu:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Relu:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D__58:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D__58"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D__58:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/weights:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__61:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__61"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__61:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Relu:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Relu:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D__62:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D__62"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D__62:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/weights:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__65:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__65"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block1/unit_3/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D__50:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D__50"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D__50:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/weights:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm__53:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm__53"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm__53:0"
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__65:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/add:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/add"
  type: "Add"
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/add:0"
  output: "resnet_v1_50/block2/unit_1/bottleneck_v1/Relu:0"
  name: "resnet_v1_50/block2/unit_1/bottleneck_v1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D__66:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D__66"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D__66:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/weights:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__69:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__69"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__69:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Relu:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Relu:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D__70:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D__70"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D__70:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/weights:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__73:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__73"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__73:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Relu:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Relu:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D__74:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D__74"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D__74:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/weights:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__77:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__77"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_1/bottleneck_v1/Relu:0"
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__77:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/add:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/add"
  type: "Add"
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/add:0"
  output: "resnet_v1_50/block2/unit_2/bottleneck_v1/Relu:0"
  name: "resnet_v1_50/block2/unit_2/bottleneck_v1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D__78:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D__78"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D__78:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/weights:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__81:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__81"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__81:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Relu:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Relu:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D__82:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D__82"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D__82:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/weights:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__85:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__85"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm__85:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Relu:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Relu:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D__86:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D__86"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D__86:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/weights:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__89:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__89"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_2/bottleneck_v1/Relu:0"
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm__89:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/add:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/add"
  type: "Add"
  arg {
    name: "broadcast"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/add:0"
  output: "resnet_v1_50/block2/unit_3/bottleneck_v1/Relu:0"
  name: "resnet_v1_50/block2/unit_3/bottleneck_v1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_3/bottleneck_v1/Relu:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D__92:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D__92"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D__92:0"
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/weights:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D"
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D:0"
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/gamma:0"
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/beta:0"
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/moving_mean:0"
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/moving_variance:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm"
  type: "SpatialBN"
  arg {
    name: "epsilon"
    f: 1.0009999641624745e-05
  }
  arg {
    name: "is_test"
    i: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__95:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__95"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 2
    ints: 3
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/BatchNorm/FusedBatchNorm__95:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Relu:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Relu"
  type: "Relu"
}
op {
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Relu:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/Pad:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/Pad"
  type: "PadImage"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
op {
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/Pad:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D__96:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D__96"
  type: "Transpose"
  arg {
    name: "axes"
    ints: 0
    ints: 3
    ints: 1
    ints: 2
  }
}
op {
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D__96:0"
  input: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/weights:0"
  output: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D:0"
  name: "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D"
